backend/controllers/SchoolController.php

SELECT * FROM `school` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = School::findOne($id)) !== null) {