backend/controllers/StaffProfessionalInfoController.php

SELECT * FROM `staff_professional_info` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = StaffProfessionalInfo::findOne($id)) !== null) {