backend/controllers/StaffController.php

SELECT * FROM `staff` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Staff::findOne($id)) !== null) {