backend/views/school/_form.php

    <?= $form->field($model, 'school_country')->dropDownList([ '1' => 'India' ], ['prompt' => 'SelectContry']) ?>


    <?= $form->field($model, 'school_state')->dropDownList(ArrayHelper::map(State::find()->all(),'state_id','state_name'),
	['prompt'=>'select state',

	]); ?>
---
SELECT * FROM `state`